<template><div><h1 id="每日总结喵-apr-16" tabindex="-1"><a class="header-anchor" href="#每日总结喵-apr-16"><span>每日总结喵 | Apr 16</span></a></h1>
<p>三天来都在做这个糖比web前端项目，做的过程一直很煎熬，不过也差不多要结束了。</p>
<h2 id="学习的思考" tabindex="-1"><a class="header-anchor" href="#学习的思考"><span>学习的思考</span></a></h2>
<p>都说学习也是个打怪升级的过程，同样作为学习的方式，我感觉做项目和刷公开课的区别就是，公开课的路线是给你规划好的，每过一关刷到的怪都经过历代游戏策划（助教）反复确认不会超模，升级路线很平稳但是可能会有点无聊，而且会把很多时间花在做玩具lab上；做项目就是纯纯技术黑箱，遇到岔口（技术难点）时你永远不知道往哪边走，路上刷新的怪（bug）也不会在意你的知识储备和感受（笑），做项目的过程就是一遍遍试错试错试错，明白走不通后再掉头往回走，再重构重构重构……这种学习方法耗的时间肯定比前者要多，但是印象肯定也比前者要深，再者如果能做完的话，也收获了一个能用于展示的小project。</p>
<p>至于我为什么选择做项目？当然是因为没的选（bushi），哎哎谁让我那么随意就我接了leader那不明来历的单子。</p>
<figure><img src="/posts/d-250416-1.gif" alt="1k买的大学生廉价劳动力太爽啦" tabindex="0" loading="lazy"><figcaption>1k买的大学生廉价劳动力太爽啦</figcaption></figure>
<p>不过如果再让我选择怎么学习，我大概也会选择做项目吧。因为只是看公开课确实太无聊了，我觉得如果我看公开课的话可能一天只会看3~4小时，但是如果让我做项目的话我一天能做12小时，这又何尝不是一种高效率呢？其次就是做项目确实比做玩具lab有意思太多太多，我一直认为学习是打怪升级，但是首先它得是个&quot;游戏&quot;，它首先得让我感兴趣才是一个&quot;游戏&quot;，不然学技术和高中的机械式刷题也没什么区别了。</p>
<h2 id="关于前端开发" tabindex="-1"><a class="header-anchor" href="#关于前端开发"><span>关于前端开发</span></a></h2>
<p>第一点感受是前端技术栈太tm多了，生态比python还活跃，有太多新的技术方案可以选择，技术选型都要选半天，选完了还不会用，抄代码都不知道怎么抄，还得把人家的实现方案copy过来，然后copy完还是不会用，不知道怎么跑起来的（笑）。所以说前端技术栈太复杂，各种工具的学习成本太高，以至于我感觉前端和前端之间的差别或许比前端和其他工程师的差别还要大。</p>
<p>第二点是感觉前端无论怎么实现，成品很容易出来，像我这样的飞舞花两周都能靠各种框架搓出来一个看起来还不错的网站，这门槛属实是有点低。</p>
<p>第三点是各种库的兼容性有时候差的难以想象，很多时候是用element / vue写了十几版组件被迫写原生（</p>
<h2 id="做了什么" tabindex="-1"><a class="header-anchor" href="#做了什么"><span>做了什么</span></a></h2>
<ul>
<li>完善了web，现在已经很豪看了</li>
<li>发现上周填的坑这周好像都没补，悲</li>
<li>明天考高数，但是啥也没复习，绩点完蛋</li>
</ul>
<h2 id="明天做什么" tabindex="-1"><a class="header-anchor" href="#明天做什么"><span>明天做什么</span></a></h2>
<ul>
<li>复习高数喽，再不复习不及格喽</li>
</ul>
</div></template>


