<template><div><h1 id="每日总结喵-apr-7" tabindex="-1"><a class="header-anchor" href="#每日总结喵-apr-7"><span>每日总结喵 | Apr 7</span></a></h1>
<h2 id="做了什么" tabindex="-1"><a class="header-anchor" href="#做了什么"><span>做了什么</span></a></h2>
<ul>
<li>省流，啥也没做</li>
<li>今天一整天都在补之前给自己挖的坑，补觉，补实验报告，补论文参考文献。是时候把一切补全再重来了</li>
<li>神回答，无需多言 如何评价小说《限制级末日症候》？。仿佛我大学水了大半年知乎被浪费的这些时光，就是为了看到这一篇回答而存在的。第一次重新发现那种对于生活的激情，和难以言喻的感动。请容我转述一小段话：</li>
</ul>
<blockquote>
<p>我来过，我思考过，我承担过，我不后悔<br>
我思考，我知道事情发生的所有可能，我选择了我自己最想达到的那种结果，我为那种结果去努力，我可能会成功，我能预想到所面临的失败，我失败了，我不后悔，我的人生无悔</p>
</blockquote>
<ul>
<li>我希望我的人生，也是这样，是深思熟虑过的人生，是对自己负责的人生，也是无悔的人生</li>
</ul>
<h2 id="明天准备做什么" tabindex="-1"><a class="header-anchor" href="#明天准备做什么"><span>明天准备做什么</span></a></h2>
<ul>
<li>估计是继续赶各种ddl，补各种作业，做完后再重新安排自己的生活吧</li>
</ul>
<p><em>编辑于 2025-04-07 23:19</em></p>
</div></template>


